{
  "format": "graph-model",
  "generatedBy": "2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "signature": {
    "inputs": {
      "input_2": {
        "name": "input_2:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "10" }] }
      }
    },
    "outputs": {
      "dense_5": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "5" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "unknown",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "10" }] }
            }
          }
        }
      },
      {
        "name": "ConstantFolding/StatefulPartitionedCall/model_1/normalization/truediv_recip",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "10" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "10" }, { "size": "8" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "8" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_4/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "8" }, { "size": "8" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_4/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "8" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_5/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "8" }, { "size": "5" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_5/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "5" }] }
            }
          }
        }
      },
      {
        "name": "input_2",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }, { "size": "10" }] } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/normalization/sub",
        "op": "Sub",
        "input": ["input_2", "unknown"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/model_1/normalization/truediv",
        "op": "Mul",
        "input": [
          "StatefulPartitionedCall/model_1/normalization/sub",
          "ConstantFolding/StatefulPartitionedCall/model_1/normalization/truediv_recip"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_3/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/model_1/normalization/truediv",
          "StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "T": { "type": "DT_FLOAT" },
          "epsilon": { "f": 0.0 },
          "transpose_a": { "b": false },
          "transpose_b": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_4/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/model_1/dense_3/Relu",
          "StatefulPartitionedCall/model_1/dense_4/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/model_1/dense_4/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_5/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/model_1/dense_4/Relu",
          "StatefulPartitionedCall/model_1/dense_5/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/model_1/dense_5/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "StatefulPartitionedCall/model_1/dense_5/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/model_1/dense_5/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/model_1/dense_5/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 987 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "unknown", "shape": [1, 10], "dtype": "float32" },
        {
          "name": "ConstantFolding/StatefulPartitionedCall/model_1/normalization/truediv_recip",
          "shape": [1, 10],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model_1/dense_3/MatMul/ReadVariableOp",
          "shape": [10, 8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model_1/dense_3/BiasAdd/ReadVariableOp",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model_1/dense_4/MatMul/ReadVariableOp",
          "shape": [8, 8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model_1/dense_4/BiasAdd/ReadVariableOp",
          "shape": [8],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model_1/dense_5/MatMul/ReadVariableOp",
          "shape": [8, 5],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model_1/dense_5/BiasAdd/ReadVariableOp",
          "shape": [5],
          "dtype": "float32"
        }
      ]
    }
  ]
}
